ebpf_research/results/raw/wrk2_v3_of_3_baseline_32500_1779426509.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.392ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.381ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms  430.85us   2.85ms   65.81%
    Req/Sec   104.37    106.80   333.00     80.66%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1363us
p95: 2077us
p99: 2345us
p99.9: 2587us
RESULT target_qps=200 actual_qps=rate p50_us=1363 p95_us=2077 p99_us=2345 p999_us=2587