ebpf_research/results/raw/wrk2_v3_of_3_isolated_40000_1779427435.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.354ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.352ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms  436.52us   2.93ms   65.64%
    Req/Sec   104.31    106.51   333.00     80.79%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1346us
p95: 2077us
p99: 2345us
p99.9: 2593us
RESULT target_qps=200 actual_qps=rate p50_us=1346 p95_us=2077 p99_us=2345 p999_us=2593