ebpf_research/results/raw/wrk2_v3_of_3_isolated_42500_1779427497.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.389ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.372ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms  423.80us   2.79ms   67.52%
    Req/Sec   104.64    107.32   333.00     79.34%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1371us
p95: 2071us
p99: 2365us
p99.9: 2599us
RESULT target_qps=200 actual_qps=rate p50_us=1371 p95_us=2071 p99_us=2365 p999_us=2599