ebpf_research/results/raw/wrk2_v3_of_3_shared_20000_1779427744.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.368ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.378ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms  422.56us   2.70ms   66.67%
    Req/Sec   104.55    107.75   333.00     79.85%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1338us
p95: 2059us
p99: 2371us
p99.9: 2613us
RESULT target_qps=200 actual_qps=rate p50_us=1338 p95_us=2059 p99_us=2371 p999_us=2613