ebpf_research/results/raw/wrk2_v3_of_3_shared_25000_1779427806.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.347ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.389ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.37ms  430.30us   2.80ms   65.86%
    Req/Sec   104.49    107.80   333.00     79.52%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1376us
p95: 2083us
p99: 2355us
p99.9: 2601us
RESULT target_qps=200 actual_qps=rate p50_us=1376 p95_us=2083 p99_us=2355 p999_us=2601