ebpf_research/results/raw/wrk2_v3_of_5_isolated_27500_1779429351.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.326ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.338ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  432.31us   2.86ms   65.23%
    Req/Sec   103.98    106.82   333.00     81.99%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1322us
p95: 2033us
p99: 2301us
p99.9: 2547us
RESULT target_qps=200 actual_qps=rate p50_us=1322 p95_us=2033 p99_us=2301 p999_us=2547