ebpf_research/results/raw/wrk2_v3_of_5_isolated_32500_1779429474.log
Running 1m test @ http://10.200.3.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.374ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.326ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms  468.77us   4.31ms   68.26%
    Req/Sec   104.71    106.93   333.00     79.06%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1353us
p95: 2137us
p99: 2537us
p99.9: 3497us
RESULT target_qps=200 actual_qps=rate p50_us=1353 p95_us=2137 p99_us=2537 p999_us=3497