ebpf_research/results/raw/wrk2_v4_of_5_baseline_25000_1779428547.log
Running 1m test @ http://10.200.4.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.239ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.164ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms  421.97us   2.90ms   66.92%
    Req/Sec   103.35    105.78   333.00     84.96%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1208us
p95: 1990us
p99: 2277us
p99.9: 2545us
RESULT target_qps=200 actual_qps=rate p50_us=1208 p95_us=1990 p99_us=2277 p999_us=2545