ebpf_research/results/raw/wrk2_v4_of_5_isolated_10000_1779429165.log
Running 1m test @ http://10.200.4.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.259ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.227ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms  406.21us   3.03ms   66.69%
    Req/Sec   103.08    105.00   333.00     86.17%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1234us
p95: 1943us
p99: 2271us
p99.9: 2589us
RESULT target_qps=200 actual_qps=rate p50_us=1234 p95_us=1943 p99_us=2271 p999_us=2589