ebpf_research/results/raw/wrk2_v4_of_5_isolated_35000_1779429536.log
Running 1m test @ http://10.200.4.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.249ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.200ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms  415.92us   2.94ms   67.47%
    Req/Sec   103.25    105.21   333.00     85.43%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1214us
p95: 1961us
p99: 2305us
p99.9: 2623us
RESULT target_qps=200 actual_qps=rate p50_us=1214 p95_us=1961 p99_us=2305 p999_us=2623