ebpf_research/results/raw/wrk2_v5_of_5_baseline_20000_1779428485.log
Running 1m test @ http://10.200.5.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.292ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.289ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.30ms  428.53us   2.84ms   66.89%
    Req/Sec   104.06    106.66   333.00     81.80%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.02
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1297us
p95: 2042us
p99: 2339us
p99.9: 2579us
RESULT target_qps=200 actual_qps=rate p50_us=1297 p95_us=2042 p99_us=2339 p999_us=2579