ebpf_research/results/raw/wrk2_v5_of_5_baseline_35000_1779428794.log
Running 1m test @ http://10.200.5.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.273ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.295ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms  429.00us   2.90ms   65.41%
    Req/Sec   104.04    106.89   333.00     81.63%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1268us
p95: 2018us
p99: 2281us
p99.9: 2593us
RESULT target_qps=200 actual_qps=rate p50_us=1268 p95_us=2018 p99_us=2281 p999_us=2593