ebpf_research/results/raw/wrk2_v5_of_5_isolated_40000_1779429659.log
Running 1m test @ http://10.200.5.2:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.255ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.220ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms  403.32us   2.60ms   66.41%
    Req/Sec   103.01    104.97   333.00     86.50%
  12002 requests in 1.00m, 1.61MB read
Requests/sec:    200.03
Transfer/sec:     27.54KB
Target QPS: 200
Actual QPS: rate
p50: 1225us
p95: 1937us
p99: 2213us
p99.9: 2513us
RESULT target_qps=200 actual_qps=rate p50_us=1225 p95_us=1937 p99_us=2213 p999_us=2513